app/controllers/api/v1/programs_controller.rb

SELECT "programs".* FROM "programs"
---
  def index
    render json: { programs: Program.all }

SELECT  "programs".* FROM "programs" WHERE "programs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."program_id" = $1 ORDER BY "reviews"."created_at" ASC  [["program_id", 1]]
SELECT "votes".* FROM "votes" WHERE (user_id = 5 AND program_id = NULL)
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."program_id" = $1 ORDER BY "reviews"."updated_at" ASC  [["program_id", 1]]
---
  def show
    @program = Program.find(params[:id])
    @reviews = @program.reviews.order(:created_at).reverse
    if current_user
      @user = current_user
      @userVotes = Vote.where('user_id = ? AND program_id = ?', @user.id, params[:program_id])
    else
      @userVotes = []
    end
    @usernames = @reviews.map { |i| i.user.user_name }

INSERT INTO "programs" ("title", "year", "rated", "run_time", "genre", "actor", "plot", "award", "poster_url", "imdb_rating", "imdb_id", "total_seasons", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15) RETURNING "id"
SELECT  "programs".* FROM "programs" WHERE "programs"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def create
    @program = Program.new(program_params)
    if current_user
      @user = current_user
      @program.user = @user
    else
      return render json: { error: ['You must be logged in to do that!'] }
    end
    if @program.save
      return render json: { program: Program.find(@program.id) }