app/controllers/api/v1/reviews_controller.rb

INSERT INTO "reviews" ("program_id", "user_id", "headline", "body", "rating", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["program_id", 1], ["user_id", 5], ["headline", "hello"], ["body", "great"], ["rating", 1], ["created_at", "2017-12-13 16:34:13.179791"], ["updated_at", "2017-12-13 16:34:13.179791"]]
---
  def create
    @review = Review.new(review_params)
    @user = current_user
    @review.user = @user

    if @review.save

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
DELETE FROM "reviews" WHERE "reviews"."id" = $1  [["id", 7]]
---
  def destroy
    @review = Review.find(params[:id])
    @review.destroy