app/controllers/api/v1/votes_controller.rb

  def create
    @vote = Vote.new(vote_params)
    @user = current_user
    @vote.user = @user
    @dbVote= Vote.where('user_id = ? AND review_id = ?', @vote.user_id, @vote.review_id)[0]
    if @dbVote
      if @dbVote.value == @vote.value
        @dbVote.value = 1
      else
        @dbVote.value = @vote.value
      end
      @dbVote.save
      @vote = @dbVote
    else @vote.save
    end
    if @vote.persisted?
      @votes = @vote.review.votes
      @vote.review.vote_count = @votes.map(&:value).inject(0, &:+)-@votes.length
      @vote.review.save
      @reviews = Program.find(params[:program_id]).reviews.reverse
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 28], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT  "votes".* FROM "votes" WHERE "votes"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
SELECT "votes".* FROM "votes"
UPDATE "reviews" SET "vote_count" = $1, "updated_at" = $2 WHERE "reviews"."id" = $3  [["vote_count", 1], ["updated_at", "2017-12-13 20:57:11.875322"], ["id", 28]]
UPDATE "votes" SET "value" = $1, "updated_at" = $2 WHERE "votes"."id" = $3  [["value", 0], ["updated_at", "2017-12-14 15:29:42.086355"], ["id", 1]]
INSERT INTO "votes" ("user_id", "value", "created_at", "updated_at", "review_id", "program_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 5], ["value", 2], ["created_at", "2017-12-14 17:54:52.812188"], ["updated_at", "2017-12-14 17:54:52.812188"], ["review_id", 3], ["program_id", 1]]
SELECT  "programs".* FROM "programs" WHERE "programs"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."program_id" = $1 ORDER BY "reviews"."created_at" ASC  [["program_id", 1]]