app/controllers/users_controller.rb

  def destroy
    @user = User.find(params[:id])
    @user.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 18], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 16]]